v2206/atmospheric_AloisLuggerPlatz/meshing/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    #include            "include/ABLConditions"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperAtm
    {
        type            zeroGradient;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform 0.14;
    }

    frontAtm
    {
        // type            cyclic;
        type            zeroGradient;
    }

    backAtm
    {
        // type            cyclic;
        type            zeroGradient;
    }

    buildings
    {
        type            kqRWallFunction;
        value           uniform 0.14;
    }
}


// ************************************************************************* //
