v2206/atmospheric_AloisLuggerPlatz/meshing/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
runApplication blockMesh

# SHM for 3D model
runApplication surfaceFeatureExtract
runApplication decomposePar -force
runParallel snappyHexMesh -overwrite
runApplication reconstructParMesh -constant
rm -r proc*
rm -r log.decom*
rm -r log.recon*
# rm -r log*


# runApplication $(getApplication)

runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar
rm -rf proc*

touch platz.foam

#------------------------------------------------------------------------------
